Revit 2027 API
RebarHostCategory Enumeration
 Rebar host category
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarHostCategory
Public Enumeration RebarHostCategory
public enum class RebarHostCategory
type RebarHostCategory
Members
Member name | Value | Description
Floor | 5 |  Floor.
Other | 0 |  Unknown or invalid host.
Part | 1 |  Part.
SlabEdge | 8 |  Slab Edge.
Stairs | 7 |  Stairs.
StructuralColumn | 2 |  Structural Column.
StructuralFoundation | 6 |  Structural Foundation.
StructuralFraming | 3 |  Structural Framing.
Wall | 4 |  Wall.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace